# language: ru

Функциональность: Получение таблицы состояний файлов

Как разработчик
Я хочу иметь возможность получать статусы файлов в/вне индекса в виде таблицы
Чтобы использовать их состояние для последующей обработки

Контекст:
    Допустим Я создаю новый объект ГитРепозиторий
    И Я создаю временный каталог и сохраняю его в контекст
    И Я инициализирую репозиторий во временном каталоге

Сценарий: Я добавляю новый файл и проверяю его статусы
    Допустим Я создаю временный файл "temp.tmp" во временном каталоге и сохраняю его в контекст
    
    И Я получаю вывод Статуса через команду
    Тогда Вывод команды содержит "?? temp.tmp"
    
    И Я получаю Массив неослеживаемых файлов
    Тогда Массив файлов содержит "temp.tmp"
    
    Также Я добавляю временный файл в индекс
    И Я получаю вывод Статуса через команду
    Тогда Вывод команды содержит "A  temp.tmp"
    И Я получаю Массив файлов к добавлению в коммит
    Тогда Массив файлов содержит "temp.tmp"
    
    Также Я фиксирую изменения с сообщением "Добавлен тестовый файл"
    И Я модифицирую временный файл
    И Я получаю вывод Статуса через команду
    Тогда Вывод команды содержит " M temp.tmp"
    И Я получаю Массив файлов вне индекса
    Тогда Массив файлов содержит "temp.tmp"
    
    Также Я фиксирую изменения с сообщением "Изменен тестовый файл"
    И Я удаляю временный файл
    И Я получаю вывод Статуса через команду
    Тогда Вывод команды содержит " D temp.tmp"
    И Я добавляю временный файл в индекс
    И Я получаю вывод Статуса через команду
    Тогда Вывод команды содержит "D  temp.tmp"
    И Я получаю Массив файлов к удалению
    Тогда Массив файлов содержит "temp.tmp"
